Documents/РаспределениеНалоговойНагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>РаспределениеНалоговойНагрузки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПроекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Оплата</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФондПодразделений</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспечениеОплата</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспеченоПоСтатье</xr:Item>
				<xr:Item>AccumulationRegister.ВознаграждениеПосредника</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДокументУТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходыВс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВознагрПосредника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыВознПосредника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыППЛО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыКоммерческие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбеспечено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФОТ_ПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РаспределениеНалоговойНагрузки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьБазуРаспределения_Уст()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Оплата.Сумма) КАК БазаРаспределения,
		|	Оплата.ЗадачаПроекта,
		|	СУММА(0) КАК Сумма,
		|	Оплата.ЗадачаПроекта.Владелец.Код КАК ЗадачаПроектаВладелецКод,
		|	НАЧАЛОПЕРИОДА(Оплата.Ссылка.Дата, МЕСЯЦ) КАК МесяцОплаты
		|ИЗ
		|	Документ.Оплата.РасшифровкаПлатежа КАК Оплата
		|ГДЕ
		|	Оплата.Ссылка.Проведен
		|	И Оплата.Сумма <> 0
		|	И Оплата.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Оплата.ЗадачаПроекта.Владелец.ГодПроекта = &ГодПроекта
		|	И (&ГодЗадачи = 0
		|			ИЛИ ВЫБОР
		|				КОГДА Оплата.ЗадачаПроекта.НачалоРабот = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА Оплата.ЗадачаПроекта.Владелец.ГодПроекта
		|				ИНАЧЕ ГОД(Оплата.ЗадачаПроекта.НачалоРабот)
		|			КОНЕЦ = &ГодЗадачи)
		|
		|СГРУППИРОВАТЬ ПО
		|	Оплата.ЗадачаПроекта,
		|	Оплата.ЗадачаПроекта.Владелец.Код,
		|	НАЧАЛОПЕРИОДА(Оплата.Ссылка.Дата, МЕСЯЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗадачаПроектаВладелецКод,
		|	МесяцОплаты";

	
	//
	Запрос.УстановитьПараметр("ГодПроекта", 	Объект.ГодПроекта );
	Запрос.УстановитьПараметр("ГодЗадачи", 		Объект.ГодЗадачи );
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоМесяца(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", 	КонецМесяца(Объект.ОкончаниеПериода));
	тзБазаРаспр = Запрос.Выполнить().Выгрузить();
	
	Возврат тзБазаРаспр;
КонецФункции

&НаСервере
Функция ПолучитьБазуРаспределения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Оплата.Сумма) КАК БазаРаспределения,
		|	Оплата.ЗадачаПроекта,
		|	СУММА(0) КАК Сумма,
		|	Оплата.ЗадачаПроекта.Владелец.Код КАК ЗадачаПроектаВладелецКод,
		|	НАЧАЛОПЕРИОДА(Оплата.Ссылка.Дата, МЕСЯЦ) КАК МесяцОплаты
		|ИЗ
		|	Документ.Оплата.РасшифровкаПлатежа КАК Оплата
		|ГДЕ
		|	Оплата.Ссылка.Проведен
		|	И Оплата.Сумма <> 0
		|	И Оплата.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (&ГодПроекта = 0
		|			ИЛИ Оплата.ЗадачаПроекта.Владелец.ГодПроекта = &ГодПроекта)
		|	И (&ГодЗадачи = 0
		|			ИЛИ Оплата.ЗадачаПроекта.ГодЗадачи = &ГодЗадачи)
		|
		|СГРУППИРОВАТЬ ПО
		|	Оплата.ЗадачаПроекта,
		|	Оплата.ЗадачаПроекта.Владелец.Код,
		|	НАЧАЛОПЕРИОДА(Оплата.Ссылка.Дата, МЕСЯЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗадачаПроектаВладелецКод,
		|	МесяцОплаты";

	
	//
	Запрос.УстановитьПараметр("ГодПроекта", 	Объект.ГодПроекта );
	Запрос.УстановитьПараметр("ГодЗадачи", 		Объект.ГодЗадачи );
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоМесяца(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", 	КонецМесяца(Объект.ОкончаниеПериода));
	тзБазаРаспр = Запрос.Выполнить().Выгрузить();
	
	Возврат тзБазаРаспр;
КонецФункции


&НаСервере
Процедура СформироватьБазуРаспределения_НаСервере( ЗаполнятьПоБазе = Истина )
	
	
	ДокОб = РеквизитФормыВЗначение("Объект");
	Если ЗаполнятьПоБазе Тогда
		тзБазаРаспр = ПолучитьБазуРаспределения();
	Иначе
		// выгружаем из табличной части
		тзБазаРаспр = ДокОб.Распределение.Выгрузить();
	КонецЕсли;
	
	ДокОб.Распределение.Очистить();
	Если ДокОб.СуммаДокумента <> 0 Тогда 
	
		// распредляем ОХР
		мКоэфф 	= тзБазаРаспр.ВыгрузитьКолонку( "БазаРаспределения" );
		мНН		= РаспределитьПропорционально( ДокОб.СуммаДокумента, мКоэфф);
		Для Каждого Стр из тзБазаРаспр Цикл
			Стр.Сумма = мНН[ тзБазаРаспр.Индекс( Стр )];
		КонецЦикла;
		
		// Записываем в таблицу документа 
		Для Каждого Стр из тзБазаРаспр Цикл
			СтрДок = ДокОб.Распределение.Добавить();
			ЗаполнитьЗначенияСвойств( СтрДок, Стр );
		КонецЦикла;
	КонецЕсли;		
		
	ЗначениеВРеквизитФормы(ДокОб, "Объект");
	
КонецПроцедуры


&НаКлиенте
Процедура СформироватьБазуРаспределения()

	Состояние( НСтр("ru = 'Документ рассчитывается...'"),,,БиблиотекаКартинок.ДлительнаяОперация48);

	СформироватьБазуРаспределения_НаСервере();
	ЭтаФорма.Модифицированность = Истина;
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры	


&НаКлиенте
Процедура ПересчетБазыРаспределения(Команда)
	СформироватьБазуРаспределения();
	//СформироватьБазуРаспределения_НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Период.ДатаНачала 		= НачалоМесяца(Период.ДатаНачала);
	Объект.НачалоПериода 	= НачалоМесяца(Период.ДатаНачала);
	
	Период.ДатаОкончания	= КонецМесяца( Период.ДатаОкончания);
	Объект.ОкончаниеПериода	= КонецМесяца( Период.ДатаОкончания);
	
	//
	СформироватьБазуРаспределения();
	//СформироватьБазуРаспределения_НаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Период.ДатаНачала 		= Объект.НачалоПериода;
	Период.ДатаОкончания	= Объект.ОкончаниеПериода;
КонецПроцедуры


&НаКлиенте
Процедура РаспределениеПослеУдаления(Элемент)
	СформироватьБазуРаспределения();	
	//СформироватьБазуРаспределения_НаСервере(Ложь);
	//ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГодПроектаПриИзменении(Элемент)
	СформироватьБазуРаспределения();
	//СформироватьБазуРаспределения_НаСервере();
	//ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГодЗадачиПриИзменении(Элемент)
	СформироватьБазуРаспределения();	
	//СформироватьБазуРаспределения_НаСервере();
	//ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	СформироватьБазуРаспределения();	
	//СформироватьБазуРаспределения_НаСервере();
	//ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры
